//;******************************************************************************
//;* Copyright (c) 2013, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

//
// HardwareMonitor Menu
//
#string STR_HARDWARE_HEALTH_MONITOR_STRING       #language en-US        "Hardware Health Monitor"
                                                 #language fr-FR        "Hardware Health Monitor"
                                                 #language zh-TW        "Hardware Health Monitor"
                                                 #language ja-JP        "Hardware Health Monitor"
												 
#string STR_HARDWARE_HEALTH_MONITOR_HELP         #language en-US        "Hardware Health Monitor Parameters"
                                                 #language fr-FR        "Hardware Health Monitor Parameters"
                                                 #language zh-TW        "Hardware Health Monitor Parameters"
                                                 #language ja-JP        "Hardware Health Monitor Parameters"

#string STR_HARDWARE_MONITOR_TITLE_VOLTAGE       #language en-US        "Voltage"
                                                 #language fr-FR        "Voltage"
                                                 #language zh-TW        "Voltage"
                                                 #language ja-JP        "Voltage"
												 
#string STR_HARDWARE_MONITOR_TITLE_TEMPERATURE   #language en-US        "Temperature"
                                                 #language fr-FR        "Temperature"
                                                 #language zh-TW        "Temperature"
                                                 #language ja-JP        "Temperature"
												 
#string STR_HARDWARE_MONITOR_TITLE_FANSPEED      #language en-US        "Fan Speed"
                                                 #language fr-FR        "Fan Speed"
                                                 #language zh-TW        "Fan Speed"
                                                 #language ja-JP        "Fan Speed"
												 
#string STR_CPU_CORE_VR_TEMP_STRING				 #language en-US        "CPU Core VR Temp"
                                                 #language fr-FR        "CPU Core VR Temp"
                                                 #language zh-TW        "CPU Core VR Temp"
                                                 #language ja-JP        "CPU Core VR Temp"

#string STR_CPU_CORE_VR_TEMP_TEXT				 #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"
												 
#string STR_HEAT_EXCHANGER_FAN_TEMP_STRING       #language en-US        "Heat Exchanger Fan Temp"
                                                 #language fr-FR        "Heat Exchanger Fan Temp"
                                                 #language zh-TW        "Heat Exchanger Fan Temp"
                                                 #language ja-JP        "Heat Exchanger Fan Temp"
												 
#string STR_HEAT_EXCHANGER_FAN_TEMP_TEXT         #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"

#string STR_SKIN_TEMP_STRING                     #language en-US        "Skin Temp"
                                                 #language fr-FR        "Skin Temp"
                                                 #language zh-TW        "Skin Temp"
                                                 #language ja-JP        "Skin Temp"
												 
#string STR_SKIN_TEMP_TEXT                       #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"
												 
#string STR_AMBIENT_TEMP_STRING                  #language en-US        "Ambient Temp"
                                                 #language fr-FR        "Ambient Temp"
                                                 #language zh-TW        "Ambient Temp"
                                                 #language ja-JP        "Ambient Temp"
												 
#string STR_AMBIENT_TEMP_TEXT                    #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"

#string STR_CPU_FAN_SPEED_STRING                 #language en-US        "CPU Fan Speed"
                                                 #language fr-FR        "CPU Fan Speed"
                                                 #language zh-TW        "CPU Fan Speed"
                                                 #language ja-JP        "CPU Fan Speed"
												 
#string STR_CPU_FAN_SPEED_TEXT                   #language en-US        "<0 Rpm>"
                                                 #language fr-FR        "<0 Rpm>"
                                                 #language zh-TW        "<0 Rpm>"
                                                 #language ja-JP        "<0 Rpm>"
												 
#string STR_DIMM0_TEMP_STRING                    #language en-US        "DIMM0 Temp"
                                                 #language fr-FR        "DIMM0 Temp"
                                                 #language zh-TW        "DIMM0 Temp"
                                                 #language ja-JP        "DIMM0 Temp"
												 
#string STR_DIMM0_TEMP_TEXT                      #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"
												 
#string STR_DIMM1_TEMP_STRING                    #language en-US        "DIMM1 Temp"
                                                 #language fr-FR        "DIMM1 Temp"
                                                 #language zh-TW        "DIMM1 Temp"
                                                 #language ja-JP        "DIMM1 Temp"
												 
#string STR_DIMM1_TEMP_TEXT                      #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"
												 
#string STR_PCH_DTS_TEMPFROM_PCH_STRING          #language en-US        "PCH DTS Temp from PCH"
                                                 #language fr-FR        "PCH DTS Temp from PCH"
                                                 #language zh-TW        "PCH DTS Temp from PCH"
                                                 #language ja-JP        "PCH DTS Temp from PCH"
												 
#string STR_PCH_DTS_TEMPFROM_PCH_TEXT            #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"
												 
#string STR_TS_ON_DIMM0_TEMP_STRING              #language en-US        "TS-on-DIMM0 Temp"
                                                 #language fr-FR        "TS-on-DIMM0 Temp"
                                                 #language zh-TW        "TS-on-DIMM0 Temp"
                                                 #language ja-JP        "TS-on-DIMM0 Temp"
												 
#string STR_TS_ON_DIMM0_TEMP_TEXT                #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"
												 
#string STR_TS_ON_DIMM1_TEMP_STRING              #language en-US        "TS-on-DIMM1 Temp"
                                                 #language fr-FR        "TS-on-DIMM1 Temp"
                                                 #language zh-TW        "TS-on-DIMM1 Temp"
                                                 #language ja-JP        "TS-on-DIMM1 Temp"
												 
#string STR_TS_ON_DIMM1_TEMP_TEXT                #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"

#string STR_CPU_TMEP_BY_PECI_STRING              #language en-US        "CPU TEMP by PECI"
                                                 #language fr-FR        "CPU TEMP by PECI"
                                                 #language zh-TW        "CPU TEMP by PECI"
                                                 #language ja-JP        "CPU TEMP by PECI"
												 
#string STR_CPU_TEMP_BY_PECI_TEXT                #language en-US        "<0 °C>"
                                                 #language fr-FR        "<0 °C>"
                                                 #language zh-TW        "<0 °C>"
                                                 #language ja-JP        "<0 °C>"

#string STR_1_05_VIN_STRING                      #language en-US        "+1.05 Vin"
                                                 #language fr-FR        "+1.05 Vin"
                                                 #language zh-TW        "+1.05 Vin"
                                                 #language ja-JP        "+1.05 Vin"
												 
#string STR_1_05_VIN_TEXT                        #language en-US        "<0 V>"
                                                 #language fr-FR        "<0 V>"
                                                 #language zh-TW        "<0 V>"
                                                 #language ja-JP        "<0 V>"
												 
#string STR_3_3_VIN_STRING                       #language en-US        "+3.3 Vin"
                                                 #language fr-FR        "+3.3 Vin"
                                                 #language zh-TW        "+3.3 Vin"
                                                 #language ja-JP        "+3.3 Vin"
												 
#string STR_3_3_VIN_TEXT                         #language en-US        "<0 V>"
                                                 #language fr-FR        "<0 V>"
                                                 #language zh-TW        "<0 V>"
                                                 #language ja-JP        "<0 V>"
												 
#string STR_5_VIN_STRING                         #language en-US        "+5 Vin"
                                                 #language fr-FR        "+5 Vin"
                                                 #language zh-TW        "+5 Vin"
                                                 #language ja-JP        "+5 Vin"
												 
#string STR_5_VIN_TEXT                           #language en-US        "<0 V>"
                                                 #language fr-FR        "<0 V>"
                                                 #language zh-TW        "<0 V>"
                                                 #language ja-JP        "<0 V>"
												 
#string STR_12_VIN_STRING                        #language en-US        "+12 Vin"
                                                 #language fr-FR        "+12 Vin"
                                                 #language zh-TW        "+12 Vin"
                                                 #language ja-JP        "+12 Vin"
												 
#string STR_12_VIN_TEXT                          #language en-US        "<0 V>"
                                                 #language fr-FR        "<0 V>"
                                                 #language zh-TW        "<0 V>"
                                                 #language ja-JP        "<0 V>"